app/Controllers/Home.php

SELECT *
FROM `kategori`
SELECT *
FROM `produk`
---
    public function index()
    {
        $token = $this->session->get('token');

        // Ambil informasi pengguna dari token
        $data = [
            'title' => "SIMS Web App",
            'token' => $token ,
            'page' => "home",
            'produk' => $this->produk->findAll(),
            'kategori' => $this->kategori->findAll()
        ];