app/Controllers/Login.php

	public function create()
	{
		$email      = $this->request->getVar('email');
		$password   = $this->request->getVar('password');

		$cek_validasi = [
			'email' => $email,
			'password' => $password,
		];
		// Cek Validasi, Jika Data Tidak Valid
		if ($this->form_validation->run($cek_validasi, 'login') == FALSE) {
			$validasi = [
				'error' => true,
				'login_error' => $this->form_validation->getErrors()
			];
			echo json_encode($validasi);
		} else {
			$cekUser = $this->user->where('email', $email)->first();
---
SELECT *
FROM `users`
WHERE `email` = 'tes@gmail.com'
 LIMIT 1