app/Controllers/Produk.php

SELECT *
FROM `produk`
SELECT *
FROM `kategori`
---
	public function index()
	{
		$token = $this->session->get('token');
		/*  dd($token); */
		$key = getenv('JWT_SECRET_KEY');
		if (!$token) {
			return redirect()->to('/accessdenied?error=Token Required');
		} else {
			try {
				$decoded = JWT::decode($token, new Key($key, 'HS256'));
				$data = [
					'title' => "SIMS Web App || Tambah Produk",
					'page' => "home",
					'id' => $decoded->uid,
					'email' => $decoded->email,
					'nama' => $decoded->nama,
					'role_id' => $decoded->role_id,
					'produk' => $this->produk->findAll(),
					'kategori' => $this->kategori->findAll()

SELECT *
FROM `produk`
WHERE `produk`.`id` = '2'
SELECT *
FROM `kategori`
---
	public function edit($id)
	{

		$token = $this->session->get('token');
		$key = getenv('JWT_SECRET_KEY');
		if (!$token) {
			return redirect()->to('/accessdenied?error=Token Required');
		} else {
			try {
				$decoded = JWT::decode($token, new Key($key, 'HS256'));
				$data = [
					'title' => "SIMS Web App || Tambah Produk",
					'page' => "produk",
					'id' => $decoded->uid,
					'email' => $decoded->email,
					'nama' => $decoded->nama,
					'role_id' => $decoded->role_id,
					'produk' => $this->produk->find($id),
					'kategori' => $this->kategori->findAll()