app/Controllers/Profil.php

    public function index()
    {
        $token = $this->session->get('token');
        $data = [
            'title' => "SIMS Web App || Profil",
            'token' => $token ,
            'page' => "profil" ,
            'nama' => $this->session->get('nama'),
            'email' => $this->session->get('email'),
            'user' => $this->user->where('email', $this->session->get('email'))->first()
        ];
---
SELECT *
FROM `users`
WHERE `email` = 'tes@gmail.com'
 LIMIT 1